# Pandas

## 시리즈

In [4]:
import pandas as pd
prices = [1000, 1010, 1020]
seris1 = pd.Series(prices)
seris1

0    1000
1    1010
2    1020
dtype: int64

In [5]:
# 인덱스 부여
dates = pd.date_range('20230101', periods=3)
seris2 = pd.Series(prices, index=dates)
seris2

2023-01-01    1000
2023-01-02    1010
2023-01-03    1020
Freq: D, dtype: int64

### date_range 활용

In [6]:
pd.date_range('2022-01-01', '2023-01-01', freq='M')
pd.date_range('2022-01-01', '2023-01-01', freq='MS')
# freq='M' 
# # M 말일을 출력한다
# MS 초일을 출력한다

DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01',
               '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01',
               '2022-09-01', '2022-10-01', '2022-11-01', '2022-12-01',
               '2023-01-01'],
              dtype='datetime64[ns]', freq='MS')

In [7]:
seris2[2] = 100
seris2

2023-01-01    1000
2023-01-02    1010
2023-01-03     100
Freq: D, dtype: int64

## 데이터프레임

In [8]:
prices = {
    'SK' : [44000, 44500, 45000],
    'Samsung' : [70100, 70200, 70300],
    'LG' : [85000, 85500, 86000]
}
df1 = pd.DataFrame(prices)
df1

      SK  Samsung     LG
0  44000    70100  85000
1  44500    70200  85500
2  45000    70300  86000

In [9]:
df2 = pd.DataFrame(prices, index=dates)
df2

               SK  Samsung     LG
2023-01-01  44000    70100  85000
2023-01-02  44500    70200  85500
2023-01-03  45000    70300  86000

## 데이터 선택
- loc : index, column 으로 데이터를 가져온다.
1. 데이터프레임의 행이나 컬럼에 label이나 boolean array로 접근.
2. location의 약어로, 인간이 읽을 수 있는 label 값으로 데이터에 접근하는 것이다. 

- iloc : 데이터 순서로 데이터를 가져온다.
1. 데이터프레임의 행이나 컬럼에 인덱스 값으로 접근.
2. integer location의 약어로, 컴퓨터가 읽을 수 있는 indexing 값으로 데이터에 접근하는 것이다.

In [10]:
df2.iloc[:,:] # df2.iloc[:] # 동일하게 전체 출력

               SK  Samsung     LG
2023-01-01  44000    70100  85000
2023-01-02  44500    70200  85500
2023-01-03  45000    70300  86000

In [11]:
df2.iloc[0] # 첫 행

SK         44000
Samsung    70100
LG         85000
Name: 2023-01-01 00:00:00, dtype: int64

In [12]:
df2.iloc[:,0] # 첫 행 전체 + 인덱스까지 출력
# 행 전체
# 열 0번째만

2023-01-01    44000
2023-01-02    44500
2023-01-03    45000
Freq: D, Name: SK, dtype: int64

In [13]:
df2.iloc[0,0]

44000

In [14]:
df2.loc['2023-01-02']

SK         44500
Samsung    70200
LG         85500
Name: 2023-01-02 00:00:00, dtype: int64

In [15]:
df2.loc[:,'SK']

2023-01-01    44000
2023-01-02    44500
2023-01-03    45000
Freq: D, Name: SK, dtype: int64

In [16]:
df2.SK # df2.column

2023-01-01    44000
2023-01-02    44500
2023-01-03    45000
Freq: D, Name: SK, dtype: int64

In [17]:
df2['POSCO'] = [450000,455000,460000]
df2

               SK  Samsung     LG   POSCO
2023-01-01  44000    70100  85000  450000
2023-01-02  44500    70200  85500  455000
2023-01-03  45000    70300  86000  460000

In [18]:
# 실습
# Q1. 2023년 1월 2일 ~ 2023 1월 3일 까지의 '삼성전자', 'LG전자' 데이터를 가져와주세요.
df2.iloc[1:3,[1,2]]

            Samsung     LG
2023-01-02    70200  85500
2023-01-03    70300  86000

In [19]:
df2.loc['2023-01-02':'2023-01-03','Samsung':'LG']

            Samsung     LG
2023-01-02    70200  85500
2023-01-03    70300  86000

In [20]:
# Q2. 데이터 70200원 가져오기 (iloc, loc 각각 활용)
df2.Samsung[1]

70200

In [21]:
df2.iloc[1,1]

70200

In [22]:
df2.loc['2023-01-02','Samsung']

70200

In [23]:
print(df2.head())

               SK  Samsung     LG   POSCO
2023-01-01  44000    70100  85000  450000
2023-01-02  44500    70200  85500  455000
2023-01-03  45000    70300  86000  460000

# 데이터프레임 확장
- concat : 그냥 가져다 붙이는 거
- merge : 공통고니 칼럼이나 인덱스가 있는가 있는 경우

In [24]:
s1 = pd.Series([50000, 500500, 501000], index=dates, name='LG화학')

In [29]:
concat_df2 = pd.concat([df2, s1], axis=1)
concat_df2.head()

               SK  Samsung     LG   POSCO    LG화학
2023-01-01  44000    70100  85000  450000   50000
2023-01-02  44500    70200  85500  455000  500500
2023-01-03  45000    70300  86000  460000  501000